Revit 2016 API
Dimension.FamilyLabel Property
The family parameter label of the dimension.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2014
Syntax
C#
public FamilyParameter FamilyLabel { get; set; }
Visual Basic
Public Property FamilyLabel As FamilyParameter
	Get
	Set
Visual C++
public:
property FamilyParameter^ FamilyLabel {
	FamilyParameter^ get ();
	void set (FamilyParameter^ value);
}
Remarks
A dimension only can be labeled to a family parameter in a family document. Multi-segmented linear dimensions cannot be labeled. To unbind the family parameter, set this property to null.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the family parameter's ParameterType is not suitable for this dimension.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when dimension can not be labeled.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when failed to get the BuiltInParameter DIM_LABEL.
See Also
Dimension Class
Autodesk.Revit.DB Namespace